# General Codes

## Imports

In [0]:
import pandas as pd
import numpy as np

In [0]:
d = {'Name': ['A','B','B','C','C','C'] , 'Place': [1, 2, np.NaN, 3, 3, 0] , 'Animal': ['y','n',np.NaN, np.NaN, np.NaN, np.NaN] , 'Thing' : [True,False,True,False,False,True]}
df = pd.DataFrame(data=d)
df

  Name  Place Animal  Thing
0    A    1.0      y   True
1    B    2.0      n  False
2    B    NaN    NaN   True
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

In [0]:
# pd.read_csv(filename) # From a CSV file
# pd.read_table(filename) # From a delimited text file (like TSV)
# pd.read_excel(filename) # From an Excel file
# pd.read_sql(query, connection_object) # Reads from a SQL table/database
# pd.read_json(json_string) # Reads from a JSON formatted string, URL or file.
# pd.read_html(url) # Parses an html URL, string or file and extracts tables to a list of dataframes
# pd.read_clipboard() # Takes the contents of your clipboard and passes it to read_table()
# pd.DataFrame(dict) # From a dict, keys for columns names, values for data as lists

## Prints

In [0]:
print('The data contains', len(df), 'rows')

The data contains 6 rows

In [0]:
print('The shape of the data is {} rows and {} columns' .format( len(df), df.shape[1]) )

The shape of the data is 6 rows and 4 columns

# Exploratory Data Analysis

## Data Structure

In [0]:
df.head(2)

  Name  Place Animal  Thing
0    A    1.0      y   True
1    B    2.0      n  False

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name      6 non-null object
Place     5 non-null float64
Animal    2 non-null object
Thing     6 non-null bool
dtypes: bool(1), float64(1), object(2)
memory usage: 230.0+ bytes

In [0]:
df.dtypes

Name       object
Place     float64
Animal     object
Thing        bool
dtype: object

In [0]:
df.describe()

         Place
count  5.00000
mean   1.80000
std    1.30384
min    0.00000
25%    1.00000
50%    2.00000
75%    3.00000
max    3.00000

In [0]:
df.index

RangeIndex(start=0, stop=6, step=1)

## Filter Data (by DataType)

In [0]:
(df.dtypes == object).sum()

2

In [0]:
df.select_dtypes(include=['object'])

  Name Animal
0    A      y
1    B      n
2    B    NaN
3    C    NaN
4    C    NaN
5    C    NaN

## Filter Data

In [0]:
df[df['Name'] == 'B']  # df.query('Name == "B"')

  Name  Place Animal  Thing
1    B    2.0      n  False
2    B    NaN    NaN   True

In [0]:
df.loc[ df['Place'].idxmax() ]

Name          C
Place         3
Animal      NaN
Thing     False
Name: 3, dtype: object

In [0]:
df[ df['Name'].str.contains('C') ]

  Name  Place Animal  Thing
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

### Slicing

In [0]:
df['Name']  # // df.Name  // df.loc['Name']

0    A
1    B
2    B
3    C
4    C
5    C
Name: Name, dtype: object

In [0]:
df.iloc[: , 1:4]

   Place Animal  Thing
0    1.0      y   True
1    2.0      n  False
2    NaN    NaN   True
3    3.0    NaN  False
4    3.0    NaN  False
5    0.0    NaN   True

## Missing Values

In [0]:
# List all columns with/without missing values
df.isnull().sum()       # len(df) - df.count() ::  same output

Name      0
Place     1
Animal    4
Thing     0
dtype: int64

In [0]:
# Which columns have how many missing values?
df.isnull().sum() [df.isnull().sum() >0]

Place     1
Animal    4
dtype: int64

In [0]:
# Set of Columns with 0 missing values
set(df.columns[df.isnull().mean()==0])  #Change ==0 to > 0.75 for columns with more than 75% values missing

{'Name', 'Thing'}

In [0]:
# Which ROWS have Missing Values
df[df.isnull().any(axis=1)]

  Name  Place Animal  Thing
2    B    NaN    NaN   True
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

In [0]:
# How many Non Null Values in Column?
np.sum(df.Animal.notnull())

2

## Duplicates

In [0]:
# How many duplicate ROWS in the entire data
df.duplicated().sum()

1

In [0]:
# Which ROWS have duplicate Names
df[ df['Name'].duplicated()]

  Name  Place Animal  Thing
2    B    NaN    NaN   True
4    C    3.0    NaN  False
5    C    0.0    NaN   True

In [0]:
# DROP DUPLICATES
df.drop_duplicates()	# use inplace = True if required

  Name  Place Animal  Thing
0    A    1.0      y   True
1    B    2.0      n  False
2    B    NaN    NaN   True
3    C    3.0    NaN  False
5    C    0.0    NaN   True

## Aggregates

In [0]:
# Whats the aggregate count of Name? 
df['Name'].value_counts()  # df.x.value_counts()

C    3
B    2
A    1
Name: Name, dtype: int64

In [0]:
# GroupBy Column 'Name' by sum of 'Place'
df.groupby('Name').Place.sum()  # df.groupby('Name').mean()['Place']

Name
A    1.0
B    2.0
C    6.0
Name: Place, dtype: float64

In [0]:
# Multiple criteria GroupBy
df.groupby(['Name', 'Thing']).count()['Place'] #:: Group by 2 values and select specific column

Name  Thing
A     True     1
B     False    1
      True     0
C     False    2
      True     1
Name: Place, dtype: int64

# Feature Engineering

## Column Operations (Rename/Keep/Drop)

In [0]:
df.rename(columns={'Name':'Names' , 'Animal':'Animals'})  # Use 'inplace=True' for changes

  Names  Place Animals  Thing
0     A    1.0       y   True
1     B    2.0       n  False
2     B    NaN     NaN   True
3     C    3.0     NaN  False
4     C    3.0     NaN  False
5     C    0.0     NaN   True

In [0]:
# Rename all columns to lowercase and replace a with A (or spaces with underscores)
df.rename(columns=lambda x: x.strip().lower().replace("a", "A"), inplace=True)
df

  nAme  plAce AnimAl  thing
0    A    1.0      y   True
1    B    2.0      n  False
2    B    NaN    NaN   True
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

In [0]:
# Another way of changing or replacing column names
df.columns = [label.replace('A', 'a') for label in df.columns]
df

  name  place animal  thing
0    A    1.0      y   True
1    B    2.0      n  False
2    B    NaN    NaN   True
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

In [0]:
df.columns = map(str.title, df.columns)  # Title is used for Propercase
df

  Name  Place Animal  Thing
0    A    1.0      y   True
1    B    2.0      n  False
2    B    NaN    NaN   True
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

In [0]:
# DROP COLUMNS
df.drop( ['Name', 'Animal'], axis=1)   # Use 'inplace=True' for changes

   Place  Thing
0    1.0   True
1    2.0  False
2    NaN   True
3    3.0  False
4    3.0  False
5    0.0   True

In [0]:
# KEEP COLUMNS
df[ ['Name','Animal'] ]

  Name Animal
0    A      y
1    B      n
2    B    NaN
3    C    NaN
4    C    NaN
5    C    NaN

## DataType Conversions

In [0]:
df.Thing.astype(int)

0    1
1    0
2    1
3    0
4    0
5    1
Name: Thing, dtype: int64

## Date Conversions

In [0]:
#df['x'] = pd.to_datetime(df['x'])

In [0]:
# Find YRMO
# mdb['rel_yr'] = mdb['release_date'].dt.year
# engagement['yrmo'] = engagement['response_date'].dt.strftime('%Y%m')
# pd.DatetimeIndex(df['ArrivalDate']).year

## Replace Values

In [0]:
# Replace values MANUALLY
df.Animal.map({'n':0, 'y':1 , np.NaN:0.5})

0    1.0
1    0.0
2    0.5
3    0.5
4    0.5
5    0.5
Name: Animal, dtype: float64

### Impute Missing Values

In [0]:
df['Animal'].fillna('o') #:: Replace missing values with another value

0    y
1    n
2    o
3    o
4    o
5    o
Name: Animal, dtype: object

In [0]:
df['Place'].replace(0,df['Place'].mean()) # Impute 0 values with mean

0    1.0
1    2.0
2    NaN
3    3.0
4    3.0
5    1.8
Name: Place, dtype: float64

### Drop Missing Values

In [0]:
# Drop all ROWS which contain ANY Missing Values
df.dropna(axis=0, how='any') # Replace how='all' to remove Rows containing ALL Missing Values

  Name  Place Animal  Thing
0    A    1.0      y   True
1    B    2.0      n  False

In [0]:
# Drop all COLUMNS containing ANY Missing Values
df.dropna(axis=1)

  Name  Thing
0    A   True
1    B  False
2    B   True
3    C  False
4    C  False
5    C   True

In [0]:
# Drop all ROWS having a missing values for a particular VARIABLE
df.dropna(subset=['Place'], how='any')

  Name  Place Animal  Thing
0    A    1.0      y   True
1    B    2.0      n  False
3    C    3.0    NaN  False
4    C    3.0    NaN  False
5    C    0.0    NaN   True

## Dummy Variable Creation

In [0]:
# Create flag if 'Animal' is present
df['Flag'] = 'Yes'
df.loc[df.Animal.isnull(), 'Flag'] = 'No'
df

  Name  Place Animal  Thing Flag
0    A    1.0      y   True  Yes
1    B    2.0      n  False  Yes
2    B    NaN    NaN   True   No
3    C    3.0    NaN  False   No
4    C    3.0    NaN  False   No
5    C    0.0    NaN   True   No

In [0]:
# Create new variable (0/1) based off another variable with multiple criteria 
df.Flag = df.Animal.apply(lambda x: 1 if x == 'y' else 0)
df

  Name  Place Animal  Thing  Flag
0    A    1.0      y   True     1
1    B    2.0      n  False     0
2    B    NaN    NaN   True     0
3    C    3.0    NaN  False     0
4    C    3.0    NaN  False     0
5    C    0.0    NaN   True     0

In [0]:
# Create new variable (0/1) based off other variables with multiple criteria
df["Flag"] = ((df["Name"] == "B") | (df["Thing"] == True)).astype(int)
df

  Name  Place Animal  Thing  Flag
0    A    1.0      y   True     1
1    B    2.0      n  False     1
2    B    NaN    NaN   True     1
3    C    3.0    NaN  False     0
4    C    3.0    NaN  False     0
5    C    0.0    NaN   True     1

In [0]:
# Create ONE HOT ENCODING for variable
pd.get_dummies(df['Name'], dummy_na=True)  # dummy_na creates dummies of NaNs

   A  B  C  NaN
0  1  0  0    0
1  0  1  0    0
2  0  1  0    0
3  0  0  1    0
4  0  0  1    0
5  0  0  1    0

In [0]:
# Create Bins
# bin_edges = [2.72, 3.11, 3.21, 3.32, 4.01]
# bin_names = ['High', 'Moderately High', 'Medium', "Low"]
# df['acidity_levels'] = pd.cut(df['pH'], bin_edges, labels=bin_names)

## Append

## Merge

In [0]:
# Simple Merge
# new_rows = df1.append(df2)